ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/CMSIS/MDR1986VK01/DeviceSupport/inc/MDR1986VK01.h
/**
  ******************************************************************************
  * @file    MDR1986VK01.h
  * @author  Milandr Application Team
  * @version V1.3.0
  * @date    21/04/2022
  * @brief   MDR1986VK01 header file
  ******************************************************************************
  * <br><br>
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, MILANDR SHALL NOT BE HELD LIABLE FOR ANY DIRECT, INDIRECT
  * OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2022 Milandr</center></h2>
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MDR1986VK01_H__
#define __MDR1986VK01_H__

/** @addtogroup __CMSIS CMSIS
  * @{
  */

/** @defgroup MDR1986VK01 MDR1986VK01
  * @{
  */

/** @defgroup MDR1986VK01_Peripheral MDR1986VK01 Peripheral
  * @{
  */

/**
  * @brief MDR1986VK01 Interrupt Number Definition
  */

typedef enum IRQn
{
/******* Cortex-M4 Processor Exceptions Numbers *******************************/
  NonMaskableInt_IRQn= -14,    ///< 2 Non Maskable Interrupt
  HardFault_IRQn     = -13,    ///< 3 Cortex-M4 Hard Fault Interrupt
  SVCall_IRQn        = -5,     ///< 11 Cortex-M4 SV Call Interrupt
  PendSV_IRQn        = -2,     ///< 14 Cortex-M4 Pend SV Interrupt
  SysTick_IRQn       = -1,     ///< 15 Cortex-M4 System Tick Interrupt

/******* Cortex-M4 specific Interrupt Numbers *********************************/
  FT_IF0_IRQn         = 32,
  FT_IF1_IRQn         = 33,
  FT_IF2_IRQn         = 34,
  FT_IF3_IRQn         = 35,
  CLK_IF_IRQn         = 36,
  RTC_IF_IRQn         = 38,
  BKP_IF_IRQn         = 39,
  EXT_INTERROR0_IRQn  = 40,
  EXT_INTERROR1_IRQn  = 41,
  EXT_INTERROR2_IRQn  = 42,
  EXT_INTERROR3_IRQn  = 43,
  EXT_INTERROR4_IRQn  = 44,
  EXT_INTERROR5_IRQn  = 45,
  EXT_INTERROR6_IRQn  = 46,
  EXT_INTERROR7_IRQn  = 47,
  IF_ERR_SCR_IRQn     = 48,
  IF_FIN_SCR_IRQn     = 49,
  DMA_ERR_IRQn        = 50,
  DMA_DONE0_IRQn      = 51,
  DMA_DONE1_IRQn      = 52,
  DMA_DONE2_IRQn      = 53,
  DMA_DONE3_IRQn      = 54,
  DMA_DONE4_IRQn      = 55,
  DMA_DONE5_IRQn      = 56,
  DMA_DONE6_IRQn      = 57,
  DMA_DONE7_IRQn      = 58,
  DMA_DONE8_IRQn      = 59,
  DMA_DONE9_IRQn      = 60,
  DMA_DONE10_IRQn     = 61,
  DMA_DONE11_IRQn     = 62,
  DMA_DONE12_IRQn     = 63,
  DMA_DONE13_IRQn     = 64,
  DMA_DONE14_IRQn     = 65,
  DMA_DONE15_IRQn     = 66,
  DMA_DONE16_IRQn     = 67,
  DMA_DONE17_IRQn     = 68,
  DMA_DONE18_IRQn     = 69,
  DMA_DONE19_IRQn     = 70,
  DMA_DONE20_IRQn     = 71,
  DMA_DONE21_IRQn     = 72,
  DMA_DONE22_IRQn     = 73,
  DMA_DONE23_IRQn     = 74,
  DMA_DONE24_IRQn     = 75,
  DMA_DONE25_IRQn     = 76,
  DMA_DONE26_IRQn     = 77,
  DMA_DONE27_IRQn     = 78,
  DMA_DONE28_IRQn     = 79,
  DMA_DONE29_IRQn     = 80,
  DMA_DONE30_IRQn     = 81,
  DMA_DONE31_IRQn     = 82,
  IRQ_PORTA_IRQn      = 83,
  IRQ_PORTB_IRQn      = 84,
  IRQ_PORTC_IRQn      = 85,
  IRQ_PORTD_IRQn      = 86,
  ETH_IRQn            = 89,
  CAN0_IRQn           = 90,
  CAN1_IRQn           = 91,
  SSP0_IRQn           = 92,
  SSP0_RXINTR_IRQn    = 93,
  SSP0_TXINTR_IRQn    = 94,
  SSP0_RORINTR_IRQn   = 95,
  SSP0_RTINTR_IRQn    = 96,
  SSP0_RNEINTR_IRQn   = 97,
  SSP0_TFEINTR_IRQn   = 98,
  SSP0_TNBSYINTR_IRQn = 99,
  SSP1_IRQn           = 100,
  SSP1_RXINTR_IRQn    = 101,
  SSP1_TXINTR_IRQn    = 102,
  SSP1_RORINTR_IRQn   = 103,
  SSP1_RTINTR_IRQn    = 104,
  SSP1_RNEINTR_IRQn   = 105,
  SSP1_TFEINTR_IRQn   = 106,
  SSP1_TNBSYINTR_IRQn = 107,
  UART0_IRQn          = 108,
  UART0_TNBSYINTR_IRQn= 109,
  UART0_TFEINTR_IRQn  = 110,
  UART0_RNEINTR_IRQn  = 111,
  UART0_EINTR_IRQn    = 112,
  UART0_RTINTR_IRQn   = 113,
  UART0_TXINTR_IRQn   = 114,
  UART0_RXINTR_IRQn   = 115,
  UART0_MSINTR_IRQn   = 116,
  UART1_IRQn          = 117,
  UART1_TNBSYINTR_IRQn= 118,
  UART1_TFEINTR_IRQn  = 119,
  UART1_RNEINTR_IRQn  = 120,
  UART1_EINTR_IRQn    = 121,
  UART1_RTINTR_IRQn   = 122,
  UART1_TXINTR_IRQn   = 123,
  UART1_RXINTR_IRQn   = 149,
  UART1_MSINTR_IRQn   = 125,
  UART2_IRQn          = 126,
  UART2_TNBSYINTR_IRQn= 127,
  UART2_TFEINTR_IRQn  = 128,
  UART2_RNEINTR_IRQn  = 129,
  UART2_EINTR_IRQn    = 130,
  UART2_RTINTR_IRQn   = 131,
  UART2_TXINTR_IRQn   = 132,
  UART2_RXINTR_IRQn   = 133,
  UART2_MSINTR_IRQn   = 134,
  UART3_IRQn          = 135,
  UART3_TNBSYINTR_IRQn= 136,
  UART3_TFEINTR_IRQn  = 137,
  UART3_RNEINTR_IRQn  = 138,
  UART3_EINTR_IRQn    = 139,
  UART3_RTINTR_IRQn   = 140,
  UART3_TXINTR_IRQn   = 141,
  UART3_RXINTR_IRQn   = 142,
  UART3_MSINTR_IRQn   = 143,
  USB_IRQn            = 144,
  MIL0_IRQn           = 145,
  DAC0_IRQn           = 146,
  DAC1_IRQn           = 147,
  DAC2_IRQn           = 148,
  DAC3_IRQn           = 149,
  DAC0_FIFO_IRQn      = 150,
  DAC1_FIFO_IRQn      = 151,
  DAC2_FIFO_IRQn      = 152,
  DAC3_FIFO_IRQn      = 153,
  TIMER0_IRQn         = 154,
  TIMER1_IRQn         = 155,
  TIMER2_IRQn         = 156,
  TIMER3_IRQn         = 157,
  QEP0_IRQn           = 158,
  QEP1_IRQn           = 159,
  CAP0_IRQn           = 162,
  CAP1_IRQn           = 163,
  CAP2_IRQn           = 164,
  CAP3_IRQn           = 165,
  EPWM8_IRQn          = 166,
  EPWM7_IRQn          = 167,
  EPWM6_IRQn          = 168,
  EPWM5_IRQn          = 169,
  EPWM4_IRQn          = 170,
  EPWM3_IRQn          = 171,
  EPWM2_IRQn          = 172,
  EPWM1_IRQn          = 173,
  EPWM0_IRQn          = 174,
  EPWM_TZ8_IRQn       = 175,
  EPWM_TZ7_IRQn       = 176,
  EPWM_TZ6_IRQn       = 177,
  EPWM_TZ5_IRQn       = 178,
  EPWM_TZ4_IRQn       = 179,
  EPWM_TZ3_IRQn       = 180,
  EPWM_TZ2_IRQn       = 181,
  EPWM_TZ1_IRQn       = 182,
  EPWM_TZ0_IRQn       = 183,
  EPWM_FIFO8_IRQn     = 184,
  EPWM_FIFO7_IRQn     = 185,
  EPWM_FIFO6_IRQn     = 186,
  EPWM_FIFO5_IRQn     = 187,
  EPWM_FIFO4_IRQn     = 188,
  EPWM_FIFO3_IRQn     = 189,
  EPWM_FIFO2_IRQn     = 190,
  EPWM_FIFO1_IRQn     = 191,
  EPWM_FIFO0_IRQn     = 192,
  CMP0_IRQn           = 193,
  CMP1_IRQn           = 194,
  CMP2_IRQn           = 195,
  CMP3_IRQn           = 196,
  ADC00_IRQn          = 197,
  ADC_FIFO00_IRQn     = 198,
  ADC01_IRQn          = 199,
  ADC_FIFO01_IRQn     = 200,
  ADC02_IRQn          = 201,
  ADC_FIFO02_IRQn     = 202,
  ADC10_IRQn          = 203,
  ADC_FIFO10_IRQn     = 204,
  ADC11_IRQn          = 205,
  ADC_FIFO11_IRQn     = 206,
  ADC12_IRQn          = 207,
  ADC_FIFO12_IRQn     = 208,
  CRDC_IRQn           = 209,
  CANFD_IRQn          = 210,
  MIL1_IRQn           = 211,
  CRPT_FIFO0_IRQn     = 212,
  CRPT_REG0_IRQn      = 213,
  CRPT_FIFO1_IRQn     = 214,
  CRPT_REG1_IRQn      = 215,
  SDIO_IRQn           = 216,
  CRPT_LOADDONE_IRQn  = 217,
  CRPT_LOCKEDUP_IRQn  = 219
} IRQn_Type;


/** @addtogroup __MDR1986VK01___Configuration_of_CMSIS Configuration of CMSIS
  * @{
  */

