ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/CMSIS/MDR1986VK01/DeviceSupport/inc/MDR1986VK01.h
/** @} */ /* End of group __MDR1986VK01_Periph_USB */

/**************************************************************************************************/
/*                         Peripheral declaration                                                 */
/**************************************************************************************************/

/** @defgroup __MDR1986VK01_Periph_CLK CLK
  * @{
  */

/**
  * @brief MDR1986VK01 CLOCK Control
  */

typedef struct
{
  __IO  uint32_t CLK;
  __IO  uint32_t CHK0;
  __IO  uint32_t CHK1;
  __IO  uint32_t CHK2;
  __IO  uint32_t STAT;
}MDR_CLK_TypeDef;

typedef struct
{
  __IO  uint32_t KEY;
  __IO  uint32_t MAX_CLK;
  __IO  uint32_t CPU_CLK;
  __IO  uint32_t PER0_CLK;
  __IO  uint32_t PER1_CLK;

  __IO  uint32_t CPU_CHK0;
  __IO  uint32_t CPU_CHK1;
  __IO  uint32_t CPU_CHK2;
  __IO  uint32_t CPU_STAT;

  MDR_CLK_TypeDef LSI;

  __IO  uint32_t HSI_STAT;

  MDR_CLK_TypeDef LSE;

  MDR_CLK_TypeDef HSE[2];

  MDR_CLK_TypeDef PLL[4];

  __IO  uint32_t EMAC0_CLK;
  __IO  uint32_t USB0_CLK;
  __IO  uint32_t USBMAC_CLK;
  __IO  uint32_t RTC0_CLK;

  __IO  uint32_t SSP0_CLK;
  __IO  uint32_t SSP1_CLK;

  __IO  uint32_t CAN0_CLK;
  __IO  uint32_t CAN1_CLK;

  __IO  uint32_t UART0_CLK;
  __IO  uint32_t UART1_CLK;
  __IO  uint32_t UART2_CLK;
  __IO  uint32_t UART3_CLK;

  __IO  uint32_t MIL0_CLK;

  __IO  uint32_t TIM0_CLK;
  __IO  uint32_t TIM1_CLK;
  __IO  uint32_t TIM2_CLK;
  __IO  uint32_t RESERVED0;
  __IO  uint32_t TIM3_CLK;

  __IO  uint32_t CAP0_CLK;
  __IO  uint32_t CAP1_CLK;
  __IO  uint32_t CAP2_CLK;
  __IO  uint32_t CAP3_CLK;

  __IO  uint32_t QEP0_CLK;
  __IO  uint32_t QEP1_CLK;

  __IO  uint32_t PWM0_CLK;
  __IO  uint32_t PWM1_CLK;
  __IO  uint32_t PWM2_CLK;
  __IO  uint32_t PWM3_CLK;
  __IO  uint32_t PWM4_CLK;
  __IO  uint32_t PWM5_CLK;
  __IO  uint32_t PWM6_CLK;
  __IO  uint32_t PWM7_CLK;
  __IO  uint32_t PWM8_CLK;

  __IO  uint32_t ADC0_CLK;
  __IO  uint32_t RESERVED1[32];
  __IO  uint32_t ADC1_CLK;
  __IO  uint32_t ADC2_CLK;
  __IO  uint32_t CRDC_CLK;
  __IO  uint32_t CANFD_CLK;
  __IO  uint32_t CRPT_CLK;
  __IO  uint32_t SDIO_CLK;
} CLKControl;

#define MDR_CLK_BASE             (PERIPH_BASE + 0x00000)

#define MDR_CLK                  ((CLKControl *) MDR_CLK_BASE)

/** @} */ /* End of group __MDR1986VK01_Periph_CLK */


/** @defgroup __MDR1986VK01_Periph_BKP BKP
  * @{
  */

/**
  * @brief MDR1986VK01 BKP control
  */

typedef struct
{
  __IO  uint32_t REG_xx[60];
  __IO  uint32_t KEY;
  __IO  uint32_t REG_64_TMR0;
  __IO  uint32_t REG_64_TMR1;
  __IO  uint32_t REG_64_TMR2;

  __IO  uint32_t REG_60_SYS0;
  __IO  uint32_t REG_61_PWR0;
  __IO  uint32_t REG_62_PWR0;
  __IO  uint32_t REG_63_CLK0;

  __IO  uint32_t REG_60_SYS1;
  __IO  uint32_t REG_61_PWR1;
  __IO  uint32_t REG_62_PWR1;
  __IO  uint32_t REG_63_CLK1;

  __IO  uint32_t REG_60_SYS2;
  __IO  uint32_t REG_61_PWR2;
  __IO  uint32_t REG_62_PWR2;
  __IO  uint32_t REG_63_CLK2;

  __IO  uint32_t RTC_CNT_TMR0;
  __IO  uint32_t RTC_DIV_TMR0;
  __IO  uint32_t RTC_PRL_TMR0;
  __IO  uint32_t RTC_ALRM_TMR0;
  __IO  uint32_t RTC_CS_TMR0;

  __IO  uint32_t RESERV_1[3];

  __IO  uint32_t RTC_CNT_TMR1;
  __IO  uint32_t RTC_DIV_TMR1;
  __IO  uint32_t RTC_PRL_TMR1;
  __IO  uint32_t RTC_ALRM_TMR1;
  __IO  uint32_t RTC_CS_TMR1;

  __IO  uint32_t RESERV_2[3];

  __IO  uint32_t RTC_CNT_TMR2;
  __IO  uint32_t RTC_DIV_TMR2;
  __IO  uint32_t RTC_PRL_TMR2;
  __IO  uint32_t RTC_ALRM_TMR2;
  __IO  uint32_t RTC_CS_TMR2;

  __IO  uint32_t RESERV_3[3];
  __IO  uint32_t BKP_PWR_CNTR0;
  __IO  uint32_t BKP_PWR_CNTR1;
  __IO  uint32_t RESERV_4;
  __IO  uint32_t BKP_PWR_CNTR2;
} BKPControl;

#define BKP_KEY                   ((uint32_t) 0x8555aaa1)

#define MDR_BKP_BASE              (PERIPH_BASE + 0x01000)

#define MDR_BKP                   ((BKPControl *) MDR_BKP_BASE)

/** @} */ /* End of group __MDR1986VK01_Periph_BKP */


// /** @defgroup __MDR1986VK01_Periph_PWR PWR
  // * @{
  // */

// /**
  // * @brief MDR1986VK01 PWR control
  // */

// typedef struct
// {
  // __IO  uint32_t KEY;

  // __IO  uint32_t CNTR0;
  // __IO  uint32_t CNTR1;
  // __IO  uint32_t CNTR2;

  // __IO  uint32_t STAT;

  // __IO  uint32_t ULIMIT;
  // __IO  uint32_t CLIMIT;
// } PWRControl;

// #define PWR_BASE                  (PERIPH_BASE + 0x02000)

// #define PWR                       ((PWRControl *) PWR_BASE)

// /** @} */ /* End of group __MDR1986VK01_Periph_PWR */


/** @defgroup __MDR1986VK01_Periph_FT FT
  * @{
  */

/**
  * @brief MDR1986VK01 FT control
  */

typedef struct
{
  __IO  uint32_t KEY;
  __IO  uint32_t CONTROL;
  __IO  uint32_t STATUS;
  __IO  uint32_t TIMEOUT;
  __IO  uint32_t TICKCNT;
  __IO  uint32_t FIRSTEVENT;
  __IO  uint32_t LASTEVENT;
  __IO  uint32_t TIMEOUTCNT;
  __IO  uint32_t EVENT[13];
  __IO  uint32_t RESET_EVENT0;
  __IO  uint32_t RESET_EVENT1;
  __IO  uint32_t RESET_EVENT2;
  __IO  uint32_t RESET_EVENT3;
  __IO  uint32_t RESET_EVENT4;
  __IO  uint32_t IE_EVENT5;
  __IO  uint32_t IE_EVENT6;
  __IO  uint32_t IE_EVENT7;
  __IO  uint32_t IE_EVENT8;
  __IO  uint32_t IE_EVENT9;
  __IO  uint32_t IE_EVENT10;
  __IO  uint32_t IE_EVENT11;
  __IO  uint32_t IE_EVENT12;
  __IO  uint32_t FT_STAT0;
  __IO  uint32_t FT_STAT1;
} FTControl;

#define MDR_FTMODE_BASE              (PERIPH_BASE + 0x03000)

#define MDR_FTMODE                   ((FTControl *) MDR_FTMODE_BASE)

/** @} */ /* End of group __MDR1986VK01_Periph_FT */


/** @defgroup __MDR1986VK01_Periph_WDT WDT
  * @{
  */

/**
  * @brief MDR1986VK01 WDT control
  */

typedef struct
{
  __IO  uint32_t KEY;
  __IO  uint32_t PRL;
  __IO  uint32_t EN;
  __IO  uint32_t CNT;
} WDTControl;

#define MDR_WDT_BASE              (PERIPH_BASE + 0x04000)

#define MDR_WDT                   ((WDTControl *) MDR_WDT_BASE)

/** @} */ /* End of group __MDR1986VK01_Periph_WDT */


/** @defgroup __MDR1986VK01_Periph_FLASH FLASH
  * @{
  */

/**
  * @brief MDR1986VK01 FLASH control
  */

typedef struct
{
  __IO  uint32_t KEY;
  __IO  uint32_t CNTR;
  __IO  uint32_t ADR;
  __IO  uint32_t WDATA3;
  __IO  uint32_t WDATA2;
  __IO  uint32_t WDATA1;
  __IO  uint32_t WDATA0;
  __IO  uint32_t WECC0;
  __IO  uint32_t WECC1;
  __IO  uint32_t RDATA3;
  __IO  uint32_t RDATA2;
  __IO  uint32_t RDATA1;
  __IO  uint32_t RDATA0;
  __IO  uint32_t RECC0;
  __IO  uint32_t RECC1;
  __IO  uint32_t ECCCS;
  __IO  uint32_t ECCADR;
  __IO  uint32_t ECCDATA;
  __IO  uint32_t ECCECC;
  __IO  uint32_t BLOCK;
} FLASHControl;

#define MDR_FLASH_BASE                (PERIPH_BASE + 0x06000)

