ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/CMSIS/MDR1986VK01/DeviceSupport/inc/MDR1986VK01.h
#define MDR_FLASH                     ((FLASHControl *) MDR_FLASH_BASE)

/** @} */ /* End of group __MDR1986VK01_Periph_FLASH */


/** @defgroup __MDR1986VK01_Periph_ROM_RAMC_RAMD ROM,RAMC,RAMD
  * @{
  */

/**
  * @brief MDR1986VK01 ROM,RAMC,RAMD control
  */

typedef struct
{
  __IO  uint32_t KEY;
  __IO  uint32_t ECCCS;
  __IO  uint32_t ECCADR;
  __IO  uint32_t ECCDATA;
  __IO  uint32_t ECCECC;
  __IO  uint32_t TEST_TUNING;
} MEMControl;

#define MDR_ROM_BASE              (PERIPH_BASE + 0x05000)
#define MDR_RAM_BASE              (PERIPH_BASE + 0x08000)

#define MDR_RAMC0_BASE            (MDR_RAM_BASE + 0x0000)
#define MDR_RAMC1_BASE            (MDR_RAM_BASE + 0x1000)
#define MDR_RAMD0_BASE            (MDR_RAM_BASE + 0x2000)
#define MDR_RAMD1_BASE            (MDR_RAM_BASE + 0x3000)

#define MDR_ROM                   ((MEMControl *) MDR_ROM_BASE)
#define MDR_RAMC0                 ((MEMControl *) MDR_RAMC0_BASE)
#define MDR_RAMC1                 ((MEMControl *) MDR_RAMC1_BASE)
#define MDR_RAMD0                 ((MEMControl *) MDR_RAMD0_BASE)
#define MDR_RAMD1                 ((MEMControl *) MDR_RAMD1_BASE)

/** @} */ /* End of group __MDR1986VK01_Periph_ROM_RAMC_RAMD */


/** @defgroup __MDR1986VK01_Periph_EBC MDR_EBC
  * @{
  */

/**
  * @brief MDR1986VK01 MDR_EBC control
  */

typedef struct
{
  __IO  uint32_t RGN0_CNTRL;
  __IO  uint32_t RGN0_ECCBASE;
  __IO  uint32_t RGN0_ECCS;
  __IO  uint32_t RGN0_STATE;

  __IO  uint32_t RGN1_CNTRL;
  __IO  uint32_t RGN1_ECCBASE;
  __IO  uint32_t RGN1_ECCS;
  __IO  uint32_t RGN1_STATE;

  __IO  uint32_t RGN2_CNTRL;
  __IO  uint32_t RGN2_ECCBASE;
  __IO  uint32_t RGN2_ECCS;
  __IO  uint32_t RGN2_STATE;

  __IO  uint32_t RGN3_CNTRL;
  __IO  uint32_t RGN3_ECCBASE;
  __IO  uint32_t RGN3_ECCS;
  __IO  uint32_t RGN3_STATE;

  __IO  uint32_t RGN4_CNTRL;
  __IO  uint32_t RGN4_ECCBASE;
  __IO  uint32_t RGN4_ECCS;
  __IO  uint32_t RGN4_STATE;

  __IO  uint32_t RGN5_CNTRL;
  __IO  uint32_t RGN5_ECCBASE;
  __IO  uint32_t RGN5_ECCS;
  __IO  uint32_t RGN5_STATE;

  __IO  uint32_t RGN6_CNTRL;
  __IO  uint32_t RGN6_ECCBASE;
  __IO  uint32_t RGN6_ECCS;
  __IO  uint32_t RGN6_STATE;

  __IO  uint32_t RGN7_CNTRL;
  __IO  uint32_t RGN7_ECCBASE;
  __IO  uint32_t RGN7_ECCS;
  __IO  uint32_t RGN7_STATE;

  __IO  uint32_t KEY;
  __IO  uint32_t ECC_ADDR;
  __IO  uint32_t ECC_DATA;
  __IO  uint32_t ECC_ECC;
  __IO  uint32_t OCLK;
} EXTBUSControl;

#define MDR_EBC_BASE              (PERIPH_BASE + 0x0C000)

#define MDR_EBC                   ((EXTBUSControl *) MDR_EBC_BASE)

#define EB_CNTR_MODE(mode)        ((mode & 3) << 4)
#define EB_CNTR_ECCMODE           4
#define EB_CNTR_ECCEN             2
#define EB_CNTR_EN                1
#define EB_CNTR_WS_HOLD(hold)     ((hold & 0xf) << 20)
#define EB_CNTR_WS_ACTIVE(act)    ((act & 0xf) << 16)
#define EB_CNTR_WS_SETUP(setup)   ((setup & 0xff) << 8)

#define EBC_EN_pos			      0
#define EBC_ECCEN_pos			  1
#define EBC_ECCMODE_pos			  2
#define EBC_RDYWAIT_pos			  3
#define EBC_MODE_pos			  4
#define EBC_ROM_pos				  6
#define EBC_CPOL_pos			  7
#define EBC_WS_ACTIVE_pos		  8
#define EBC_WS_SETUP_pos		  16
#define EBC_WS_HOLD_pos			  20
#define EBC_ECC8BIT_pos		      24
#define EBC_ENOCLK_pos			  27
#define EBC_DIVOCLK_pos			  28

#define EBC_EN_MSK			      ((uint32_t) 0x00000001)
#define EBC_ECCEN_MSK			  ((uint32_t) 0x00000002)
#define EBC_ECCMODE_MSK			  ((uint32_t) 0x00000004)
#define EBC_RDYWAIT_MSK			  ((uint32_t) 0x00000008)
#define EBC_MODE_MSK			  ((uint32_t) 0x00000030)
#define EBC_ROM_MSK				  ((uint32_t) 0x00000040)
#define EBC_CPOL_MSK			  ((uint32_t) 0x00000080)
#define EBC_WS_ACTIVE_MSK		  ((uint32_t) 0x0000FF00)
#define EBC_WS_SETUP_MSK		  ((uint32_t) 0x000F0000)
#define EBC_WS_HOLD_MSK			  ((uint32_t) 0x00F00000)
#define EBC_USESEPAR_MSK		  ((uint32_t) 0x01000000)
#define EBC_CACHEBLE_MSK		  ((uint32_t) 0x02000000)
#define EBC_READ32_MSK			  ((uint32_t) 0x04000000)
#define EBC_ENOCLK_MSK			  ((uint32_t) 0x08000000)
#define EBC_DIVOCLK_MSK			  ((uint32_t) 0xF0000000)

/** @} */ /* End of group __MDR1986VK01_Periph_EBC */


/** @defgroup __MDR1986VK01_Periph_PORT MDR_PORT
  * @{
  */

/**
  * @brief MDR1986VK01 PORT control
  */

typedef struct
{
  __IO  uint32_t KEY;
  __IO  uint32_t RXTX;
  __IO  uint32_t SRXTX;
  __IO  uint32_t CRXTX;

  __IO  uint32_t SOE;
  __IO  uint32_t COE;

  __IO  uint32_t SFUNC[4];

  __IO  uint32_t CFUNC[4];

  __IO  uint32_t SANALOG;
  __IO  uint32_t CANALOG;

  __IO  uint32_t SPULLUP;
  __IO  uint32_t CPULLUP;

  __IO  uint32_t SPULLDOWN;
  __IO  uint32_t CPULLDOWN;

  __IO  uint32_t SPD;
  __IO  uint32_t CPD;

  __IO  uint32_t SPWR[2];
  __IO  uint32_t CPWR[2];

  __IO  uint32_t SCL;
  __IO  uint32_t CCL;

  __IO  uint32_t SIE;
  __IO  uint32_t CIE;

  __IO  uint32_t SIT;
  __IO  uint32_t CIT;

  __IO  uint32_t SIR;
  __IO  uint32_t CIR;

  __IO  uint32_t HCUR;
} PortControl;

#define MDR_PORT_BASE             (PERIPH_BASE + 0x80000)

#define MDR_PORTA_BASE                (MDR_PORT_BASE + 0x0000)
#define MDR_PORTB_BASE                (MDR_PORT_BASE + 0x1000)
#define MDR_PORTC_BASE                (MDR_PORT_BASE + 0x2000)
#define MDR_PORTD_BASE                (MDR_PORT_BASE + 0x3000)

#define MDR_PORTA                     ((PortControl *) MDR_PORTA_BASE)
#define MDR_PORTB                     ((PortControl *) MDR_PORTB_BASE)
#define MDR_PORTC                     ((PortControl *) MDR_PORTC_BASE)
#define MDR_PORTD                     ((PortControl *) MDR_PORTD_BASE)

#define FUNC_MASK 0x0f
#define FUNCREGNUM(pin) (pin >> 3)
#define _FUNCPIN(TYPE) TYPE ## FUNC
#define FUNCPIN(pin,TYPE) _FUNCPIN(TYPE)[FUNCREGNUM(pin)]
#define SFUNCPIN(pin) FUNCPIN(pin,S)
#define CFUNCPIN(pin) FUNCPIN(pin,C)
#define FUNCVAL(pin,func) ((func & FUNC_MASK) << ((pin % 8)<<2))

#define PWR_MASK 0x3
#define PWRREGNUM(pin) (pin >> 4)
#define _PWRPIN(type) type ## PWR
#define PWRPIN(pin, type) _PWRPIN(type)[PWRREGNUM(pin)]
#define SPWRPIN(pin) PWRPIN(pin, S)
#define CPWRPIN(pin) PWRPIN(pin, C)
#define PWRVAL(pin, pwr) ((pwr & PWR_MASK) << ((pin % 16) << 1))

/** @} */ /* End of group __MDR1986VK01_Periph_PORT */


/** @defgroup __MDR1986VK01_Periph_CANFD CANFD
  * @{
  */

/**
  * @brief MDR1986VK01 MDR_CANFD control
  */

typedef struct
{
  __IO    uint32_t CTRL[3];
}MDR_CANFD_TXCTRL_TypeDef;

typedef struct
{
  /* Control registers */
  __IO  uint32_t CONTROL;
  __IO  uint32_t CFG0;
  __IO  uint32_t CFG1;
  __IO  uint32_t CFG2;
  __IO  uint32_t CFG3;
  /* Filter config register */
  __IO  uint32_t RXFCFG;
  /* Prescalers */
  __IO  uint32_t PRSC;
  __IO  uint32_t FPRSC;
  /* IRQ resiters */
  __I   uint32_t ST;
  __IO  uint32_t MSK;
  /* Rx queue Base Addr */
  __IO  uint32_t RXBADDR;
  /* Tx queue Base Addr */
  __IO  uint32_t TXBADDR[4];
  /* Timer register */
  __I   uint32_t CURTIMEHi;
  __I   uint32_t CURTIMELo;
        uint32_t Reserved1[3];

