ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/CMSIS/MDR1986VK01/DeviceSupport/inc/MDR1986VK01.h
#define MDR_TIMER0                ((MDR_TIMER_TypeDef *) MDR_TIMER0_BASE)
#define MDR_TIMER1                ((MDR_TIMER_TypeDef *) MDR_TIMER1_BASE)
#define MDR_TIMER2                ((MDR_TIMER_TypeDef *) MDR_TIMER2_BASE)
#define MDR_TIMER3                ((MDR_TIMER_TypeDef *) MDR_TIMER3_BASE)

/** @} */ /* End of group __MDR1986VK01_Periph_TIMER */


/** @defgroup __MDR1986VK01_Periph_CAP	MDR_CAP
  * @{
  */

/**
  * @brief MDR1986VK01 CAPx control
  */

typedef struct
{
  __IO  uint32_t TSCTR;
  __IO  uint32_t CTRPHS;
  __IO  uint32_t CAP1;
  __IO  uint32_t CAP2;
  __IO  uint32_t CAP3;
  __IO  uint32_t CAP4;
  __IO  uint32_t ECCTL1;
  __IO  uint32_t ECCTL2;
  __IO  uint32_t ECEINT;
  __IO  uint32_t ECFLG;
  __IO  uint32_t ECCLR;
  __IO  uint32_t ECFRC;
} CAPControl;

#define MDR_CAP_BASE              (PERIPH_BASE + 0x90000)

#define MDR_CAP0_BASE                 (MDR_CAP_BASE + 0x8000)
#define MDR_CAP1_BASE                 (MDR_CAP_BASE + 0x9000)
#define MDR_CAP2_BASE                 (MDR_CAP_BASE + 0xA000)
#define MDR_CAP3_BASE                 (MDR_CAP_BASE + 0xB000)

#define MDR_CAP0                  ((CAPControl  *) MDR_CAP0_BASE)
#define MDR_CAP1                  ((CAPControl  *) MDR_CAP1_BASE)
#define MDR_CAP2                  ((CAPControl  *) MDR_CAP2_BASE)
#define MDR_CAP3                  ((CAPControl  *) MDR_CAP3_BASE)

/** @} */ /* End of group __MDR1986VK01_Periph_CAP */


/** @defgroup __MDR1986VK01_Periph_QEP	MDR_QEP
  * @{
  */

/**
  * @brief MDR1986VK01 QEPx control
  */

typedef struct
{
  __IO  uint32_t QDECCTL;
  __IO  uint32_t QEPCTL;
  __IO  uint32_t QPOSCTL;
  __IO  uint32_t QCAPCTL;
  __IO  uint32_t QPOSCNT;
  __IO  uint32_t QPOSINIT;
  __IO  uint32_t QPOSMAX;
  __IO  uint32_t QPOSCMP;
  __IO  uint32_t QPOSILAT;
  __IO  uint32_t QPOSSLAT;
  __IO  uint32_t QPOSLAT;
  __IO  uint32_t QUTMR;
  __IO  uint32_t QUPRD;
  __IO  uint32_t QWDTMR;
  __IO  uint32_t QEINT;
  __IO  uint32_t QFLG;
  __IO  uint32_t QCLR;
  __IO  uint32_t QFRC;
  __IO  uint32_t QEPSTS;
  __IO  uint32_t QWDPRD;
  __IO  uint32_t QCTMR;
  __IO  uint32_t QCTMR1;
  __IO  uint32_t QCTMR2;
  __IO  uint32_t QCTMR3;
  __IO  uint32_t QCTMR4;
  __IO  uint32_t QCPRD;
  __IO  uint32_t QCTMRLAT;
  __IO  uint32_t QCPRDLAT;
} QEPControl;

#define MDR_QEP_BASE              (PERIPH_BASE + 0x90000)

#define MDR_QEP0_BASE                 (MDR_QEP_BASE + 0xC000)
#define MDR_QEP1_BASE                 (MDR_QEP_BASE + 0xD000)

#define MDR_QEP0                      ((QEPControl  *) MDR_QEP0_BASE)
#define MDR_QEP1                      ((QEPControl  *) MDR_QEP1_BASE)

/** @} */ /* End of group __MDR1986VK01_Periph_QEP */


/** @defgroup __MDR1986VK01_Periph_PWM	MDR_PWMx
  * @{
  */

/**
  * @brief MDR1986VK01 PWMx control
  */

typedef struct
{
  __IO  uint32_t TBPRD;
  uint32_t RESERVED0;
  __IO  uint32_t TBPHS;
  __IO  uint32_t TBCTR;
  __IO  uint32_t TBCTL;
  __IO  uint32_t TBSTS;
  __IO  uint32_t CMPA;
  __IO  uint32_t CMPB;
  __IO  uint32_t CMPCTL;
  uint32_t RESERVED1;
  __IO  uint32_t AQCTLA;
  __IO  uint32_t AQCTLB;
  __IO  uint32_t AQSFRC;
  __IO  uint32_t AQCSFRC;
  __IO  uint32_t DBCTL;
  __IO  uint32_t DBRED;
  __IO  uint32_t DBFED;
  __IO  uint32_t PCCTL;
  __IO  uint32_t TZSEL;
  __IO  uint32_t TZCTL;
  __IO  uint32_t TZEINT;
  __IO  uint32_t TZFLG;
  __IO  uint32_t TZCLR;
  __IO  uint32_t TZFRC;
  __IO  uint32_t ETSEL;
  __IO  uint32_t ETPS;
  __IO  uint32_t ETFLG;
  __IO  uint32_t ETCLR;
  __IO  uint32_t ETFRC;
  uint32_t RESERVED2;
  uint32_t RESERVED3;
  __IO  uint32_t HRPWM_CTRL;

} PWMControl;

#define MDR_PWM_BASE              (PERIPH_BASE +  0x9E000)

#define MDR_PWM0_BASE                 (MDR_PWM_BASE + 0x00000)
#define MDR_PWM1_BASE                 (MDR_PWM_BASE + 0x01000)
#define MDR_PWM2_BASE                 (MDR_PWM_BASE + 0x02000)
#define MDR_PWM3_BASE                 (MDR_PWM_BASE + 0x03000)
#define MDR_PWM4_BASE                 (MDR_PWM_BASE + 0x04000)
#define MDR_PWM5_BASE                 (MDR_PWM_BASE + 0x05000)
#define MDR_PWM6_BASE                 (MDR_PWM_BASE + 0x06000)
#define MDR_PWM7_BASE                 (MDR_PWM_BASE + 0x07000)
#define MDR_PWM8_BASE                 (MDR_PWM_BASE + 0x08000)

#define MDR_PWM0                      ((PWMControl  *) MDR_PWM0_BASE)
#define MDR_PWM1                      ((PWMControl  *) MDR_PWM1_BASE)
#define MDR_PWM2                      ((PWMControl  *) MDR_PWM2_BASE)
#define MDR_PWM3                      ((PWMControl  *) MDR_PWM3_BASE)
#define MDR_PWM4                      ((PWMControl  *) MDR_PWM4_BASE)
#define MDR_PWM5                      ((PWMControl  *) MDR_PWM5_BASE)
#define MDR_PWM6                      ((PWMControl  *) MDR_PWM6_BASE)
#define MDR_PWM7                      ((PWMControl  *) MDR_PWM7_BASE)
#define MDR_PWM8                      ((PWMControl  *) MDR_PWM8_BASE)

/** @} */ /* End of group __MDR1986VK01_Periph_PWM */


/** @defgroup __MDR1986VK01_Periph_ADC	MDR_ADC
  * @{
  */

/**
  * @brief MDR1986VK01 ADCx control
  */

typedef struct
{
  __IO  uint32_t ADC0CTRL;
  __IO  uint32_t ADC1CTRL;
  __IO  uint32_t ADC0SCOPECTRL;
  __IO  uint32_t ADC1SCOPECTRL;
  __IO  uint32_t ADCSYNCCTRL;
  __IO  uint32_t BUF_MODE_ADC;
  __IO  uint32_t BUF_STATE;
  __IO  uint32_t INT_CTRL_ADC;
  __IO  uint32_t DMARQ_CTRL_ADC;
    uint32_t Reserved0;
  __IO  uint32_t ANALOG_CTRL;
  __IO  uint32_t BNGP_CTRL;
  uint32_t Reserved1[4];
  __IO  uint32_t ADC0_CHNL_SEL[8];
  __IO  uint32_t ADC1_CHNL_SEL[8];
  __IO  uint32_t ADC0_RESULT[32];
  __IO  uint32_t ADC1_RESULT[32];
} ADCxControl;

#define MDR_ADC_BASE              (PERIPH_BASE + 0xA0000)

#define MDR_ADC0_BASE                 (MDR_ADC_BASE + 0x7000)
#define MDR_ADC1_BASE                 (MDR_ADC_BASE + 0x8000)
#define MDR_ADC2_BASE                 (MDR_ADC_BASE + 0x9000)

#define MDR_ADC0                      ((ADCxControl *) MDR_ADC0_BASE)
#define MDR_ADC1                      ((ADCxControl *) MDR_ADC1_BASE)
#define MDR_ADC2                      ((ADCxControl *) MDR_ADC2_BASE)

/** @} */ /* End of group __MDR1986VK01_Periph_ADC */


/** @defgroup __MDR1986VK01_Periph_DAC	DAC
  * @{
  */

/**
  * @brief MDR1986VK01 DACx control
  */

typedef struct
{
  __IO  uint32_t CTRL;
  __IO  uint32_t FIFO_CTRL;
  __IO  uint32_t PRD;
  __IO  uint32_t CNT;

  __IO  uint32_t IE;
  __IO  uint32_t RE;
  __IO  uint32_t STS;
  __IO  uint32_t DATA;
} DACxControl;

