ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/CMSIS/MDR1986VK01/DeviceSupport/inc/MDR1986VK01.h
#define MDR_DAC_BASE              (PERIPH_BASE + 0xA0000)

#define MDR_DAC0_BASE             (MDR_DAC_BASE + 0xA000)
#define MDR_DAC1_BASE             (MDR_DAC_BASE + 0xB000)
#define MDR_DAC2_BASE             (MDR_DAC_BASE + 0xC000)
#define MDR_DAC3_BASE             (MDR_DAC_BASE + 0xD000)

#define MDR_DAC0                  ((DACxControl *) MDR_DAC0_BASE)
#define MDR_DAC1                  ((DACxControl *) MDR_DAC1_BASE)
#define MDR_DAC2                  ((DACxControl *) MDR_DAC2_BASE)
#define MDR_DAC3                  ((DACxControl *) MDR_DAC3_BASE)

/** @} */ /* End of group __MDR1986VK01_Periph_DAC */


/** @defgroup __MDR1986VK01_Periph_COMP	COMP
  * @{
  */

/**
  * @brief MDR1986VK01 COMP control
  */

typedef struct
{
  __IO  uint32_t COMP_CNTR;
  __IO  uint32_t COMP_EVNT;
  __IO  uint32_t ANABG_CTRL;
} CompControl;

#define MDR_COMP_BASE             (PERIPH_BASE + 0xA0000)

#define MDR_COMP0_BASE            (MDR_COMP_BASE + 0x0E000)
#define MDR_COMP1_BASE            (MDR_COMP_BASE + 0x0F000)
#define MDR_COMP2_BASE            (MDR_COMP_BASE + 0x10000)
#define MDR_COMP3_BASE            (MDR_COMP_BASE + 0x11000)

#define MDR_COMP0                 ((CompControl *) MDR_COMP0_BASE)
#define MDR_COMP1                 ((CompControl *) MDR_COMP1_BASE)
#define MDR_COMP2                 ((CompControl *) MDR_COMP2_BASE)
#define MDR_COMP3                 ((CompControl *) MDR_COMP3_BASE)

/** @} */ /* End of group __MDR1986VK01_Periph_COMP */


/** @defgroup __MDR1986VK01_Periph_I2C	I2C
  * @{
  */

/**
  * @brief MDR1986VK01 MDR_I2C control
  */

typedef struct
{
  __IO  uint32_t PRL;
  __IO  uint32_t PRH;
  __IO  uint32_t CTR;
  __IO  uint32_t RXD;
  __IO  uint32_t STA;
  __IO  uint32_t TXD;
  __IO  uint32_t CMD;
}MDR_I2C_TypeDef;

#define MDR_I2C_BASE              (PERIPH_BASE   + 0xB2000)

#define MDR_I2C                   ((MDR_I2C_TypeDef *) MDR_I2C_BASE)

/** @defgroup Periph_I2C_CTR	I2C_CTR
  * @{
  */

/**
  * @brief I2C Control Register
  */

/* Bit field positions: */
#define I2C_CTR_S_I2C_Pos                       5
#define I2C_CTR_EN_INT_Pos                      6
#define I2C_CTR_EN_I2C_Pos                      7

/* Bit field masks: */
#define I2C_CTR_S_I2C                           ((uint32_t)0x00000020)
#define I2C_CTR_EN_INT                          ((uint32_t)0x00000040)
#define I2C_CTR_EN_I2C                          ((uint32_t)0x00000080)

/** @} */ /* End of group Periph_I2C_CTR */

/** @defgroup Periph_I2C_STA	I2C STA
  * @{
  */

/**
  * @brief I2C Status Register
  */

/* Bit field positions: */
#define I2C_STA_INT_Pos                         0
#define I2C_STA_TR_PROG_Pos                     1
#define I2C_STA_LOST_ARB_Pos                    5
#define I2C_STA_BUSY_Pos                        6
#define I2C_STA_RX_ACK_Pos                      7

/* Bit field masks: */
#define I2C_STA_INT                             ((uint32_t)0x00000001)
#define I2C_STA_TR_PROG                         ((uint32_t)0x00000002)
#define I2C_STA_LOST_ARB                        ((uint32_t)0x00000020)
#define I2C_STA_BUSY                            ((uint32_t)0x00000040)
#define I2C_STA_RX_ACK                          ((uint32_t)0x00000080)

/** @} */ /* End of group Periph_I2C_STA */

/** @defgroup Periph_I2C_CMD	I2C CMD
  * @{
  */

/**
  * @brief I2C Command Register
  */

/* Bit field positions: */
#define I2C_CMD_CLRINT_Pos                      0
#define I2C_CMD_ACK_Pos                         3
#define I2C_CMD_WR_Pos                          4
#define I2C_CMD_RD_Pos                          5
#define I2C_CMD_STOP_Pos                        6
#define I2C_CMD_START_Pos                       7

/* Bit field masks: */
#define I2C_CMD_CLRINT                          ((uint32_t)0x00000001)
#define I2C_CMD_ACK                             ((uint32_t)0x00000008)
#define I2C_CMD_WR                              ((uint32_t)0x00000010)
#define I2C_CMD_RD                              ((uint32_t)0x00000020)
#define I2C_CMD_STOP                            ((uint32_t)0x00000040)
#define I2C_CMD_START                           ((uint32_t)0x00000080)

/** @} */ /* End of group Periph_I2C_CMD */

/** @} */ /* End of group __MDR1986VK01_Periph_I2C */


/** @defgroup __MDR1986VK01_Periph_CORDIC	CORDIC
  * @{
  */

/**
  * @brief MDR1986VK01 CORDICx control
  */

typedef struct
{
  __IO  uint32_t CTRL;
  __IO  uint32_t STATUS;
  __IO  uint32_t INTF;
  __IO  uint32_t INTE;
  __IO  uint32_t IN_X;
  __IO  uint32_t IN_Y;
  __IO  uint32_t IN_A;
  __IO  uint32_t IN_SEQ;
  __IO  uint32_t OUT_X;
  __IO  uint32_t OUT_Y;
  __IO  uint32_t OUT_A;
  __IO  uint32_t OUT_SEQ;
  __IO  uint32_t IN_ADDR;
  __IO  uint32_t OUT_ADDR;
} CRDControl;

#define MDR_CORDIC_BASE           (PERIPH_BASE + 0xB0000)

#define MDR_CORDIC0_BASE          (MDR_CORDIC_BASE + 0x3000)

#define MDR_CORDIC                ((CRDControl  *) MDR_CORDIC0_BASE)

/** @} */ /* End of group __MDR1986VK01_Periph_CORDIC */


/** @defgroup __MDR1986VK01_Periph_CRC	CRC
  * @{
  */

typedef struct
{
  __IO  uint32_t DR;          ///< CRC Data register,             Address offset: 0x00
  __IO  uint8_t  IDR;         ///< CRC Independent data register, Address offset: 0x04
        uint8_t  RESERVED0;   ///< Reserved,                                      0x05
        uint16_t RESERVED1;   ///< Reserved,                                      0x06
  __IO  uint32_t CR;          ///< CRC Control register,          Address offset: 0x08
        uint32_t RESERVED2;   ///< Reserved,                                      0x0C
  __IO  uint32_t INIT;        ///< Initial CRC value register,    Address offset: 0x10
  __IO  uint32_t POL;         ///< CRC polynomial register,       Address offset: 0x14
} CRC_TypeDef;


#define MDR_CRC_BASE                (PERIPH_BASE + 0xB6000)

#define MDR_CRC                     ((CRC_TypeDef *) MDR_CRC_BASE)

/** @} */ /* End of group __MDR1986VK01_Periph_CRC */


/** @defgroup __MDR1986VK01_Periph_GATE	Gate
  * @{
  */

typedef struct
{
    __IO uint32_t OP_FIFO_OP_TO_SF;
    __IO uint32_t OP_FIFO_SF_TO_OP;
    __IO uint32_t OP_FIFO_LEVELS;
    __IO uint32_t OP_FIFO_INT_MASK;
    __IO uint32_t OP_FIFO_INT_SOURCE;
    __IO uint32_t OP_REG[16];
    __IO uint32_t OP_REGS_BUSY;
    __IO uint32_t OP_REGS_INT_MASK;
    __IO uint32_t OP_REGS_INT_SOURCE;
} GateRegs;

#define GATE_BASE               ((uint32_t)0x21030000)
#define GATE_REGS               ((GateRegs *)GATE_BASE)


#define GATE0_REGS_BASE         GATE_BASE // backward compability alias
#define GATE1_REGS_BASE         ((uint32_t)0x21030080)

#define GATE0_REGS              ((GateRegs *)GATE0_REGS_BASE)
#define GATE1_REGS              ((GateRegs *)GATE1_REGS_BASE)


