ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/CMSIS/MDR1986VK01/DeviceSupport/inc/MDR1986VK01.h
/** @} */ /* End of group __MDR1986VK01_Periph_GATE */

/************************* Alias definitions **********************************/

#if defined (MDR_LEGACY_SUPPORT)
    #warning "Legacy 1.1.1+: REG_60-63_TMRx in MDR_BKP replaced with REG_60_SYSx, REG_61-62_PWRx, REG_63_CLKx according to spec. These alias definitions will be removed in 2.0 version"
    #define REG_60_TMR0 REG_60_SYS0
    #define REG_60_TMR1 REG_60_SYS1
    #define REG_60_TMR2 REG_60_SYS2
    #define REG_61_TMR0 REG_61_PWR0
    #define REG_61_TMR1 REG_61_PWR1
    #define REG_61_TMR2 REG_61_PWR2
    #define REG_62_TMR0 REG_62_PWR0
    #define REG_62_TMR1 REG_62_PWR1
    #define REG_62_TMR2 REG_62_PWR2
    #define REG_63_TMR0 REG_63_CLK0
    #define REG_63_TMR1 REG_63_CLK1
    #define REG_63_TMR2 REG_63_CLK2
#endif

#if defined (MDR_LEGACY_SUPPORT)
    #warning "Legacy 1.3.0+: Changed "TBSY" to "TNBSY" in UART_IT_TBSY (MDR_UART), SSPx/UARTx_TBSYINTR_IRQn (MDR1986VK01) and SSPx/UARTx_TBSYINTR_IRQHandler (startup) according to spec. These alias definitions will be removed in 2.0 version"
    #define UART_IT_TBSY UART_IT_TNBSY
    #define SSP0_TBSYINTR_IRQn SSP0_TNBSYINTR_IRQn
    #define SSP1_TBSYINTR_IRQn SSP1_TNBSYINTR_IRQn
    #define UART0_TBSYINTR_IRQn UART0_TNBSYINTR_IRQn
    #define UART1_TBSYINTR_IRQn UART1_TNBSYINTR_IRQn
    #define UART2_TBSYINTR_IRQn UART2_TNBSYINTR_IRQn
    #define UART3_TBSYINTR_IRQn UART3_TNBSYINTR_IRQn
    #define SSP0_TBSYINTR_IRQHandler SSP0_TNBSYINTR_IRQHandler
    #define SSP1_TBSYINTR_IRQHandler SSP1_TNBSYINTR_IRQHandler
    #define UART0_TBSYINTR_IRQHandler UART0_TNBSYINTR_IRQHandler
    #define UART1_TBSYINTR_IRQHandler UART1_TNBSYINTR_IRQHandler
    #define UART2_TBSYINTR_IRQHandler UART2_TNBSYINTR_IRQHandler
    #define UART3_TBSYINTR_IRQHandler UART3_TNBSYINTR_IRQHandler
#endif

#endif /* __MDR1986VK01_H__ */

/*********************** (C) COPYRIGHT 2022 Milandr ****************************
*
* END OF FILE MDR1986VK01.h */


